#ifndef __HLBTGATT_CLIENT_H__
#define __HLBTGATT_CLIENT_H__

#ifdef __cplusplus
extern "C"
{
#endif

#include <stdint.h>
#include <stdbool.h>

typedef void (*disconnect_func_t)(int32_t errCode, void *user_data);
typedef void (*notify_func_t)(uint16_t value_hanlde, const uint8_t *value, uint16_t length);

struct advertising_devices {
	int8_t rssi;
	uint8_t addr_type;
	uint8_t addr[18];
	uint8_t name[32];
};

/*******************************************************************************
功能描述: 初始化bt client模块
输入参数: 无
输出参数: 无
返回值域: 0成功，其他失败
--------------------------------------------------------------------------------
修改作者: 肖勇健
修改日期: 2023年6月21
修改说明: 实现
*******************************************************************************/
int32_t hlgatt_client_init(void);

/*******************************************************************************
功能描述: 扫描蓝牙设备
输入参数: obj_name搜索指定名字设备，如果为空返回所有扫描到的设备
		 scan_time_sec扫描超时时间
输出参数: add为结构体数组，每一个设备是一个add对象
		 size扫描到的个数，也就是add结构体数组的大小
返回值域: 0成功，其他失败
--------------------------------------------------------------------------------
修改作者: 肖勇健
修改日期: 2023年6月21
修改说明: 实现
*******************************************************************************/
int32_t hlgatt_client_get_advertising_devices(struct advertising_devices **add, size_t *size, const char *obj_name, int32_t scan_time_sec);

/*******************************************************************************
功能描述: 连接蓝牙设备
输入参数: addr蓝牙设备的mac地址
		 disconnect_func_t意外断开的回调通知
输出参数: 无
返回值域: 正值是fd句柄，返回0或则<0失败
--------------------------------------------------------------------------------
修改作者: 肖勇健
修改日期: 2023年6月21
修改说明: 实现
*******************************************************************************/
int32_t hlgatt_client_start(uint8_t add_type, uint8_t *addr, disconnect_func_t disconnect_func);

/*******************************************************************************
功能描述: 获取蓝牙指定服务上的特征值handle
输入参数: fd client的句柄
		 server_uuid服务UUID
		 eigenvalue_uuid特征值UUID
输出参数: value_handle特征值句柄
		 desc_handle notify的特征值句柄
返回值域: 0成功，其他失败
--------------------------------------------------------------------------------
修改作者: 肖勇健
修改日期: 2023年6月21
修改说明: 实现
*******************************************************************************/
int32_t hlgatt_client_get_eigenvalue_handle(uint32_t fd, uint8_t *server_uuid, uint8_t *eigenvalue_uuid, uint16_t *value_handle, uint16_t *desc_handle);

/*******************************************************************************
功能描述: 注册蓝牙指定服务上的特征值notify
输入参数: fd client的句柄
		 notify_func notify回调函数
输出参数: 无
返回值域: 0成功，其他失败
--------------------------------------------------------------------------------
修改作者: 肖勇健
修改日期: 2023年6月26
修改说明: 实现
*******************************************************************************/
int32_t hlgatt_client_register_notify_eigenvalue_callback(uint32_t fd, notify_func_t notify_func);

/*******************************************************************************
功能描述: 打开/关闭notify上报开关
输入参数: fd client的句柄
		 desc_handle notify的特征值句柄
		 on 1打开，0关闭
输出参数: 无
返回值域: 0成功，其他失败
--------------------------------------------------------------------------------
修改作者: 肖勇健
修改日期: 2023年6月26
修改说明: 实现
*******************************************************************************/
int32_t hlgatt_client_notify_on(uint32_t fd, uint16_t desc_handle, bool on);

/*******************************************************************************
功能描述: 给特征值写入数据
输入参数: fd client的句柄
		 value_handle特征值句柄
		 value写入数据的buf
		 length需要写入数据的长度
输出参数: 无
返回值域: 0成功，其他失败
--------------------------------------------------------------------------------
修改作者: 肖勇健
修改日期: 2023年6月21
修改说明: 实现
*******************************************************************************/
int32_t hlgatt_client_write_value(uint32_t fd, uint16_t value_handle, const uint8_t *value, uint16_t length);

/*******************************************************************************
功能描述: 读取特征值上的数据
输入参数: fd client的句柄
		 value_handle特征值句柄
输出参数: value数据的buf
		 length数据的长度
返回值域: 0成功，其他失败
--------------------------------------------------------------------------------
修改作者: 肖勇健
修改日期: 2023年6月21
修改说明: 实现
*******************************************************************************/
int32_t hlgatt_client_read_value(uint32_t fd, uint16_t value_handle, const uint8_t **value, uint16_t *length);

/*******************************************************************************
功能描述: 主动断开client的连接
输入参数: 该client的fd句柄
输出参数: 无
返回值域: 0成功，其他失败
--------------------------------------------------------------------------------
修改作者: 肖勇健
修改日期: 2023年6月21
修改说明: 实现
*******************************************************************************/
int32_t hlgatt_client_end(uint32_t fd);

/*******************************************************************************
功能描述: 返始化bt client模块，调用之前需要断开所有client的连接
输入参数: 无
输出参数: 无
返回值域: 0成功，其他失败
--------------------------------------------------------------------------------
修改作者: 肖勇健
修改日期: 2023年6月21
修改说明: 实现
*******************************************************************************/
int32_t hlgatt_client_deinit(void);

#ifdef __cplusplus
}
#endif

#endif
